Revit 2027 API
ShapeImporter.Convert Method
 Converts the geometry stored in the external format into a collection of Revit geometry objects.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<GeometryObject> Convert(
	Document document,
	string filename
)
Public Function Convert (
	document As Document,
	filename As String
) As IList(Of GeometryObject)
public:
IList<GeometryObject^>^ Convert(
	Document^ document,
	String^ filename
)
member Convert :
        document : Document *
        filename : string -> IList<GeometryObject>
Parameters
document Document
 The Revit document where the resulting Revit geometry objects will be used. This document may need to be modified to store dependent elements such as graphics styles and/or materials.
filename String
 The full path to the input file.
Return Value
IList<GeometryObject>
 A collection of Revit geometry objects created from the incoming data.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
FileArgumentNotFoundException |  The given filename does not exist.
InvalidOperationException |  Data conversion service is not available, or the Material Library is missing.
See Also
Reference
ShapeImporter Class
Autodesk.Revit.DB Namespace